turbulenceMultiphase/tutorials/turbulenceMultiphaseFlume/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue	    uniform 0.001;
        value           uniform 0.001;
    }
    outlet
    {
        type            inletOutlet;
        inletValue	    uniform 0.001;
        value           uniform 0.001;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue	    uniform 0.001;
        value           uniform 0.001;
    }
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            omegaWallFunction;
        value           uniform 0.001;
    }
}


// ************************************************************************* //
